morpheby/esp32_can/src/ch32v203_can_builtin.cpp
/*
  CH32_CAN.cpp - Library for CH32V203 built-in CAN module
    Original library for ESP32 reworked to support CH32v20x chips with Arduino and FreeRTOS
  
  Author: Ilya Mikhaltsou
  
  Created: 12.01.2025
*/

#include "Arduino.h"
#include "ch32vxxx/ch32vxxx_isr.h"
#include "ch32v203_can_builtin.h"
#include "ch32yyxx_can.h"
#include "spdlog/logger.h"

#if __has_include("spdlog/spdlog.h")
#include "spdlog/spdlog.h"

static std::shared_ptr<spdlog::logger> logger = nullptr;
#endif

typedef struct
{
    CANTimingConfig_t cfg;
    uint32_t speed;
} VALID_TIMING;

// FIXME: Hardcoded value
#if CH32_SYSCLK_FREQ_HZ == 144'000'000
#define CAN_CLOCK_FREQ (CH32_SYSCLK_FREQ_HZ)/2
#elif CH32_SYSCLK_FREQ_HZ == 120'000'000
#define CAN_CLOCK_FREQ (CH32_SYSCLK_FREQ_HZ)/2
#endif

#define CAN_BRP_FROM_RESOLUTION_HZ(freq) ((CAN_CLOCK_FREQ)/(freq))

#define CAN_TIMING_CONFIG(quanta_hz, ts1, ts2, sjw_v) {.brp = CAN_BRP_FROM_RESOLUTION_HZ((quanta_hz)), .tseg_1 = (ts1) - 1, .tseg_2 = (ts2) - 1, .sjw = (sjw_v) - 1}

#define CAN_TIMING_CONFIG_NULL      CAN_TIMING_CONFIG(CAN_CLOCK_FREQ, 1, 1, 1)

#if CH32_SYSCLK_FREQ_HZ == 144'000'000

#if CAN_BRP_FROM_RESOLUTION_HZ(16000) < 1024
// NOTE: Configuration not tested and not even calculated. Consider using bitcalc or other software to adjust
// #define CAN_TIMING_CONFIG_1KBITS        CAN_TIMING_CONFIG(16000, 13, 2, 1)
#endif

#if CAN_BRP_FROM_RESOLUTION_HZ(80000) < 1024
// NOTE: Configuration not tested and not even calculated. Consider using bitcalc or other software to adjust
// #define TWAI_TIMING_CONFIG_5KBITS       CAN_TIMING_CONFIG(80000, 13, 2, 1)
#endif

#if CAN_BRP_FROM_RESOLUTION_HZ(160000) < 1024
#define CAN_TIMING_CONFIG_10KBITS       CAN_TIMING_CONFIG(160'000, 13, 2, 1)
#endif

#define CAN_TIMING_CONFIG_20KBITS       CAN_TIMING_CONFIG(320'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_50KBITS       CAN_TIMING_CONFIG(800'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_100KBITS      CAN_TIMING_CONFIG(1'600'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_125KBITS      CAN_TIMING_CONFIG(2'000'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_250KBITS      CAN_TIMING_CONFIG(4'000'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_500KBITS      CAN_TIMING_CONFIG(8'000'000, 12, 3, 2)
#define CAN_TIMING_CONFIG_800KBITS      CAN_TIMING_CONFIG(16'000'000, 14, 5, 3)
#define CAN_TIMING_CONFIG_1MBITS        CAN_TIMING_CONFIG(16'000'000, 11, 4, 3)

#elif CH32_SYSCLK_FREQ_HZ == 120'000'000

#if CAN_BRP_FROM_RESOLUTION_HZ(16000) < 1024
// NOTE: Configuration not tested and not even calculated. Consider using bitcalc or other software to adjust
// #define CAN_TIMING_CONFIG_1KBITS        CAN_TIMING_CONFIG(16000, 13, 2, 1)
#endif

#if CAN_BRP_FROM_RESOLUTION_HZ(80000) < 1024
// NOTE: Configuration not tested and not even calculated. Consider using bitcalc or other software to adjust
// #define TWAI_TIMING_CONFIG_5KBITS       CAN_TIMING_CONFIG(80000, 13, 2, 1)
#endif

#if CAN_BRP_FROM_RESOLUTION_HZ(160000) < 1024
#define CAN_TIMING_CONFIG_10KBITS       CAN_TIMING_CONFIG(160'000, 13, 2, 1)
#endif

#define CAN_TIMING_CONFIG_20KBITS       CAN_TIMING_CONFIG(300'800, 12, 2, 1)
#define CAN_TIMING_CONFIG_50KBITS       CAN_TIMING_CONFIG(800'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_100KBITS      CAN_TIMING_CONFIG(1'500'000, 12, 2, 1)
#define CAN_TIMING_CONFIG_125KBITS      CAN_TIMING_CONFIG(2'000'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_250KBITS      CAN_TIMING_CONFIG(4'000'000, 13, 2, 1)
#define CAN_TIMING_CONFIG_500KBITS      CAN_TIMING_CONFIG(5'000'000, 7, 2, 2)
#define CAN_TIMING_CONFIG_800KBITS      CAN_TIMING_CONFIG(12'000'000, 10, 4, 3)
#define CAN_TIMING_CONFIG_1MBITS        CAN_TIMING_CONFIG(12'000'000, 8, 3, 3)

#endif

static QueueHandle_t rx_queue;
static QueueHandle_t tx_queue;
static bool canNeedsBusReset = false;


#if configSUPPORT_STATIC_ALLOCATION
#if !defined(CAN_RX_ON_MAIN_LOOP)
static StaticTask_t CAN_Rx_task;
static StackType_t CAN_Rx_task_stack[128];
#endif
static StaticTask_t CAN_Tx_task;
static StackType_t CAN_Tx_task_stack[128];
#endif

#if !defined(CAN_RX_ON_MAIN_LOOP)
static TaskHandle_t CAN_Rx_handler_task = NULL;
#endif
static TaskHandle_t CAN_Tx_handler_task = NULL;

// static CanTxMsg mailboxMessages[3];
// static uint16_t mailboxRetransmitCounter[3] = {0, 0, 0};

//because of the way the TWAI library works, it's just easier to store the valid timings here and anything not found here
//is just plain not supported. If you need a different speed then add it here. Be sure to leave the zero record at the end
//as it serves as a terminator
const VALID_TIMING valid_timings[] = 
{
    {CAN_TIMING_CONFIG_1MBITS,   1000000},
    {CAN_TIMING_CONFIG_500KBITS,  500000},
    {CAN_TIMING_CONFIG_250KBITS,  250000},
    {CAN_TIMING_CONFIG_125KBITS,  125000},
    {CAN_TIMING_CONFIG_800KBITS,  800000},
    {CAN_TIMING_CONFIG_100KBITS,  100000},
    {CAN_TIMING_CONFIG_50KBITS,    50000},
    {CAN_TIMING_CONFIG_20KBITS,    20000},
    {CAN_TIMING_CONFIG_20KBITS,        0} //this is a terminator record. When the code sees an entry with 0 speed it stops searching
};

static void frameToMsg(CanTxMsg *msg, const CAN_FRAME *frame) {
    msg->IDE = frame->extended ? CAN_Id_Extended : CAN_Id_Standard;
    msg->StdId = frame->id;
    msg->ExtId = frame->id;
    msg->DLC = frame->length;
    msg->RTR = frame->rtr ? CAN_RTR_Remote : CAN_RTR_Data;
    if (!frame->rtr) {
        memcpy(msg->Data, frame->data.bytes, frame->length);
    }
}

#if !(USE_TINYUSB)

// CAN doesn't work with USB, unless you have remap available. CH32V203K8T6 doesn't, so can't really test this.

_ISR_DEF(USB_LP_CAN1_RX0_IRQHandler) {
    // CAN FIFO0
    static CanRxMsg msg;

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (rx_queue) {
        while (CAN_MessagePending(CAN1, CAN_FIFO0)) {
            uint16_t timestamp = (CAN1->sFIFOMailBox[0].RXMDTR & CAN_RXMDT0R_TIME) >> 16;
            CAN_Receive(CAN1, CAN_FIFO0, &msg);
            if (xQueueIsQueueFullFromISR(rx_queue)) {
                break;
            }

            CAN_FRAME frame;
            frame.id = (msg.IDE == CAN_Id_Extended) ? msg.ExtId : msg.StdId;
            frame.extended = msg.IDE == CAN_Id_Extended;
            frame.timestamp = timestamp;
            frame.length = std::min(msg.DLC, (uint8_t) 8);
            frame.rtr = msg.RTR == CAN_RTR_Remote;
            uint8_t filterGrpNum = 0;
            int filterNum = msg.FMI;
            for (filterGrpNum = 0; filterGrpNum < 28; ++filterGrpNum) {
                uint16_t mlt = 1;
                uint32_t filter_number_bit_pos = ((uint32_t)1) << filterGrpNum;
                if (CAN1->FAFIFOR & filter_number_bit_pos) continue;
                if (!(CAN1->FSCFGR & filter_number_bit_pos)) mlt *= 2;
                if (CAN1->FMCFGR & filter_number_bit_pos) mlt *= 2;
                filterNum -= mlt;
                if (filterNum < 0) break;
            }
            frame.fid = filterGrpNum;
            if (!frame.rtr) {
                memcpy(frame.data.bytes, msg.Data, frame.length);
            }
            
            xQueueSendFromISR(rx_queue, &frame, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }

