morpheby/esp32_can/src/ch32v203_can_builtin.cpp
    CAN_ClearFlag(CAN1, CAN_FLAG_FF0 | CAN_FLAG_FOV0);
    CAN_ClearITPendingBit(CAN1,  CAN_IT_FMP0 | CAN_IT_FF0 | CAN_IT_FOV0);
}

_ISR_DEF(CAN1_RX1_IRQHandler) {
    // CAN FIFO1
    static CanRxMsg msg;

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (rx_queue) {
        while (CAN_MessagePending(CAN1, CAN_FIFO1)) {
            uint16_t timestamp = (CAN1->sFIFOMailBox[1].RXMDTR & CAN_RXMDT1R_TIME) >> 16;
            CAN_Receive(CAN1, CAN_FIFO1, &msg);
            if (xQueueIsQueueFullFromISR(rx_queue)) {
                break;
            }

            CAN_FRAME frame;
            frame.id = (msg.IDE == CAN_Id_Extended) ? msg.ExtId : msg.StdId;
            frame.extended = msg.IDE == CAN_Id_Extended;
            frame.timestamp = timestamp;
            frame.length = std::min(msg.DLC, (uint8_t) 8);
            frame.rtr = msg.RTR == CAN_RTR_Remote;
            uint8_t filterGrpNum = 0;
            int filterNum = msg.FMI;
            for (filterGrpNum = 0; filterGrpNum < 28; ++filterGrpNum) {
                uint16_t mlt = 1;
                uint32_t filter_number_bit_pos = ((uint32_t)1) << filterGrpNum;
                if (!(CAN1->FAFIFOR & filter_number_bit_pos)) continue;
                if (!(CAN1->FSCFGR & filter_number_bit_pos)) mlt *= 2;
                if (CAN1->FMCFGR & filter_number_bit_pos) mlt *= 2;
                filterNum -= mlt;
                if (filterNum < 0) break;
            }
            frame.fid = filterGrpNum;
            if (!frame.rtr) {
                memcpy(frame.data.bytes, msg.Data, frame.length);
            }
            
            xQueueSendFromISR(rx_queue, &frame, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }

    CAN_ClearFlag(CAN1, CAN_FLAG_FF1 | CAN_FLAG_FOV1);
    CAN_ClearITPendingBit(CAN1,  CAN_IT_FMP1 | CAN_IT_FF1 | CAN_IT_FOV1);
}

_ISR_DEF(USB_HP_CAN1_TX_IRQHandler) {
    // CAN TX
    // Find an empty mailbox or a mailbox with a failure
    // CanTxMsg mailboxMessages_new[3];
    // uint16_t mailboxRetransmitCounter_new[3] = {0, 0, 0};
    CanTxMsg mailboxMessage;

    CAN_FRAME frame;

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (tx_queue) {
        for (int i = 0; i < 3; ++i) {
            switch (CAN_TransmitStatus(CAN1, i)) {
            case CAN_TxStatus_Pending:
                // This one is full, ignore it
                // mailboxMessages_new[j] = mailboxMessages[i];
                // mailboxRetransmitCounter_new[j] = mailboxRetransmitCounter[i];
                break;
                
            case CAN_TxStatus_Failed:
            //     // This queue has an error. Check what error it is and either discard or retransmit
            //     if(mailboxRetransmitCounter[i] < CAN_MAX_RETRANSMIT_COUNT) {
            //         uint8_t mb = CAN_TxStatus_NoMailBox;
            //         do {
            //             mb = CAN_Transmit(CAN1, mailboxMessages + i);
            //         } while (mb == CAN_TxStatus_NoMailBox);
            //         mailboxMessages_new[mb] = mailboxMessages[i];
            //         mailboxRetransmitCounter_new[mb] = mailboxRetransmitCounter[i];
            //         Serial.printf("Retransmit: %u\n", mailboxRetransmitCounter_new[mb]);
            //         if (mb < i) {
            //             i = mb;
            //         }
            //         break;
            //     }
            // check why we get tons of dropped messages
                // Serial.println("Drop CAN message");
                // fallthrough
            case CAN_TxStatus_Ok:
                // This one has finished, get a new message from the queue and send it
                if (xQueueReceiveFromISR(tx_queue, &frame, &xHigherPriorityTaskWoken) == pdTRUE) {
                    frameToMsg(&mailboxMessage, &frame);
                    uint8_t mb = CAN_TxStatus_NoMailBox;
                    do {
                        mb = CAN_Transmit(CAN1, &mailboxMessage);
                    } while (mb == CAN_TxStatus_NoMailBox);
                    // mailboxMessages_new[mb] = mailboxMessages[i];
                    // if (mb < i) {
                    //     i = mb;
                    // }
                } else {
                    vTaskNotifyGiveFromISR(CAN_Tx_handler_task, &xHigherPriorityTaskWoken);
                }
                
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);

                break;
            }
        }
        // memcpy(mailboxMessages, mailboxMessages_new, 3 * sizeof(CanTxMsg));
        // memcpy(mailboxRetransmitCounter, mailboxRetransmitCounter_new, 3 * sizeof(uint16_t));
    }
    
    CAN_ClearFlag(CAN1, CAN_FLAG_RQCP0 | CAN_FLAG_RQCP1 | CAN_FLAG_RQCP2);
    CAN_ClearITPendingBit(CAN1,  CAN_IT_TME);
}

_ISR_DEF(CAN1_SCE_IRQHandler) {
    // CAN Error
    if (CAN_GetFlagStatus(CAN1, CAN_FLAG_BOF) == SET) {
        canNeedsBusReset = true;
    }
    if (CAN_GetFlagStatus(CAN1, CAN_FLAG_EPV) == SET) {
        canNeedsBusReset = true;
    }
    if (CAN_GetFlagStatus(CAN1, CAN_FLAG_SLAK) == SET) {
        canNeedsBusReset = true;
    }

    CAN_ClearFlag(CAN1, CAN_FLAG_EWG | CAN_FLAG_EPV | CAN_FLAG_BOF | CAN_FLAG_LEC | CAN_FLAG_SLAK);
    CAN_ClearITPendingBit(CAN1,  CAN_IT_EWG | CAN_IT_EPV | CAN_IT_BOF | CAN_IT_LEC | CAN_IT_ERR | CAN_IT_WKU | CAN_IT_SLK);
}

#endif

CH32CAN::CH32CAN() : CAN_COMMON(BI_NUM_FILTERS) 
{
    rxBufferSize = CAN_RX_QUEUE_BUFFER_SIZE;
    txBufferSize = CAN_TX_QUEUE_BUFFER_SIZE;

    readyForTraffic = false;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);

    cyclesSinceTraffic = 0;
}

#if defined(CAN_RX_ON_MAIN_LOOP)
void CH32CAN::loop() {
    const TickType_t xDelay = 0;
    CAN_FRAME frame;

    auto espCan = this;

#else
void CAN_Rx_handler(void *pvParameters)
{
    CH32CAN* espCan = (CH32CAN*)pvParameters;
    const TickType_t xDelay = 200 / portTICK_PERIOD_MS;
    CAN_FRAME frame;

    for(;;)
    {
#endif
        if (xQueueReceive(rx_queue, &frame, xDelay) != pdTRUE) {
            espCan->cyclesSinceTraffic++;
            
            uint8_t lastError = CAN_GetLastErrorCode(CAN1);

