morpheby/esp32_can/src/ch32v203_can_builtin.cpp
            if (lastError != CAN_ErrorCode_NoErr)
            {
                #ifdef SPDLOG_DEBUG
                logger->warn(SPDLOG_FMT_STRING("CAN error detected on bus: {:x}"), (int)lastError);
                #endif
            }
            if (canNeedsBusReset) {
                espCan->cyclesSinceTraffic = 0;
                espCan->readyForTraffic = false;
                canNeedsBusReset = false;

                #ifdef SPDLOG_DEBUG
                logger->warn("CAN bus will be reset");
                #endif

                // Clear bus flags
                CAN_ClearFlag(CAN1, CAN_FLAG_EWG | CAN_FLAG_EPV | CAN_FLAG_BOF | CAN_FLAG_LEC);
                
                disable();
                enable();
            }
#if defined(CAN_RX_ON_MAIN_LOOP)
            return;
#else
            continue;
#endif
        }
        espCan->processFrame(frame, frame.fid);
#if defined(CAN_RX_ON_MAIN_LOOP)
    return;
}
#else
    }
}
#endif

void CAN_Tx_handler(void *pvParameters)
{
    // CH32CAN* espCan = (CH32CAN*)pvParameters;
    CAN_FRAME frame;
    
    for(;;)
    {
        if ((CAN1->TSTATR & (CAN_TSTATR_TME0 | CAN_TSTATR_TME1 | CAN_TSTATR_TME2)) == (CAN_TSTATR_TME0 | CAN_TSTATR_TME1 | CAN_TSTATR_TME2)) {
            if (xQueueReceive(tx_queue, &frame, portMAX_DELAY) != pdTRUE) {
                continue;
            }

            // Jump-start queue
            CanTxMsg mailboxMessage;
            frameToMsg(&mailboxMessage, &frame);

            // We are 100% certain this is going to be the first mailbox,
            // and to prevent races we want to set it before queue has started
            // mailboxMessages[0] = mailboxMessage;
            // mailboxRetransmitCounter[0] = 0;
            CAN_Transmit(CAN1, &mailboxMessage);
        } else {
            ulTaskNotifyTake(1, pdMS_TO_TICKS(100));
        }
    }
}

void CH32CAN::setRXBufferSize(int newSize)
{
    rxBufferSize = newSize;
}

void CH32CAN::setTXBufferSize(int newSize)
{
    txBufferSize = newSize;
}

void CH32CAN::watchForList(uint8_t mailbox, uint32_t id1, bool rtr1, uint32_t id2, bool rtr2) {
    uint32_t fullFilterId1 = (id1 << 3) | (rtr1 ? 0x2 : 0) | 0x4;
    uint32_t fullFilterId2 = (id2 << 3) | (rtr2 ? 0x2 : 0) | 0x4;
    CAN_FilterInitTypeDef filter {
        .CAN_FilterIdHigh = (uint16_t) (fullFilterId1 >> 16),
        .CAN_FilterIdLow  = (uint16_t) (fullFilterId1 & 0x0000FFFF),
        .CAN_FilterMaskIdHigh = (uint16_t) (fullFilterId2 >> 16),
        .CAN_FilterMaskIdLow  = (uint16_t) (fullFilterId2 & 0x0000FFFF),
        .CAN_FilterFIFOAssignment = ((mailbox & 1) ? CAN_Filter_FIFO1 : CAN_Filter_FIFO0), // Split between mailboxes to get more FIFO size
        .CAN_FilterNumber = mailbox,
        .CAN_FilterMode = CAN_FilterMode_IdList,
        .CAN_FilterScale = CAN_FilterScale_32bit,
        .CAN_FilterActivation = ENABLE,
    };
    CAN_FilterInit(&filter);
    filterIsConfigured[mailbox] = true;
}

void CH32CAN::watchForList(uint8_t mailbox, uint16_t id1, bool rtr1, uint16_t id2, bool rtr2, uint16_t id3, bool rtr3, uint16_t id4, bool rtr4) {
    uint16_t fullFilterId1 = (id1 << 5) | (rtr1 ? 0x10 : 0);
    uint16_t fullFilterId2 = (id2 << 5) | (rtr2 ? 0x10 : 0);
    uint16_t fullFilterId3 = (id3 << 5) | (rtr3 ? 0x10 : 0);
    uint16_t fullFilterId4 = (id4 << 5) | (rtr4 ? 0x10 : 0);
    CAN_FilterInitTypeDef filter {
        .CAN_FilterIdHigh = fullFilterId3,
        .CAN_FilterIdLow  = fullFilterId1,
        .CAN_FilterMaskIdHigh = fullFilterId4,
        .CAN_FilterMaskIdLow  = fullFilterId2,
        .CAN_FilterFIFOAssignment = ((mailbox & 1) ? CAN_Filter_FIFO1 : CAN_Filter_FIFO0), // Split between mailboxes to get more FIFO size
        .CAN_FilterNumber = mailbox,
        .CAN_FilterMode = CAN_FilterMode_IdList,
        .CAN_FilterScale = CAN_FilterScale_16bit,
        .CAN_FilterActivation = ENABLE,
    };
    CAN_FilterInit(&filter);
    filterIsConfigured[mailbox] = true;
}

void CH32CAN::watchForMask(uint8_t mailbox, uint32_t id, uint32_t mask, bool rtr, bool rtrMask, bool onlyExtendedId) {
    uint32_t fullFilterId   = (id   << 3) | (rtr     ? 0x2 : 0) | 0x4;
    uint32_t fullFilterMask = (mask << 3) | (rtrMask ? 0x2 : 0) | (onlyExtendedId ? 0x4 : 0);
    CAN_FilterInitTypeDef filter {
        .CAN_FilterIdHigh = (uint16_t) (fullFilterId >> 16),
        .CAN_FilterIdLow  = (uint16_t) (fullFilterId & 0x0000FFFF),
        .CAN_FilterMaskIdHigh = (uint16_t) (fullFilterMask >> 16),
        .CAN_FilterMaskIdLow  = (uint16_t) (fullFilterMask & 0x0000FFFF),
        .CAN_FilterFIFOAssignment = ((mailbox & 1) ? CAN_Filter_FIFO1 : CAN_Filter_FIFO0), // Split between mailboxes to get more FIFO size
        .CAN_FilterNumber = mailbox,
        .CAN_FilterMode = CAN_FilterMode_IdMask,
        .CAN_FilterScale = CAN_FilterScale_32bit,
        .CAN_FilterActivation = ENABLE,
    };
    CAN_FilterInit(&filter);
    filterIsConfigured[mailbox] = true;
}

void CH32CAN::watchForMask(uint8_t mailbox, uint16_t id1, uint16_t mask1, bool rtr1, bool rtrMask1,
                           uint16_t id2, uint16_t mask2, bool rtr2, bool rtrMask2) {
    uint16_t fullFilterId1   = (id1   << 5) | (rtr1     ? 0x10 : 0);
    uint16_t fullFilterMask1 = (mask1 << 5) | (rtrMask1 ? 0x10 : 0) | 0x8;
    uint16_t fullFilterId2   = (id2   << 5) | (rtr2     ? 0x10 : 0);
    uint16_t fullFilterMask2 = (mask2 << 5) | (rtrMask2 ? 0x10 : 0) | 0x8;
    CAN_FilterInitTypeDef filter {
        .CAN_FilterIdHigh = fullFilterId2,
        .CAN_FilterIdLow  = fullFilterId1,
        .CAN_FilterMaskIdHigh = fullFilterMask2,
        .CAN_FilterMaskIdLow  = fullFilterMask1,
        .CAN_FilterFIFOAssignment = ((mailbox & 1) ? CAN_Filter_FIFO1 : CAN_Filter_FIFO0), // Split between mailboxes to get more FIFO size
        .CAN_FilterNumber = mailbox,
        .CAN_FilterMode = CAN_FilterMode_IdMask,
        .CAN_FilterScale = CAN_FilterScale_16bit,
        .CAN_FilterActivation = ENABLE,
    };
    CAN_FilterInit(&filter);
    filterIsConfigured[mailbox] = true;
}

