morpheby/esp32_can/src/ch32v203_can_builtin.cpp
int CH32CAN::_setFilterSpecific(uint8_t mailbox, uint32_t id, uint32_t mask, bool extended)
{
    if (mailbox >= BI_NUM_FILTERS) {
        return -1;
    }

    watchForMask(mailbox, id, mask);
    return mailbox;
}

int CH32CAN::_setFilter(uint32_t id, uint32_t mask, bool extended)
{
    int i;
    for (i = 0; i < BI_NUM_FILTERS; ++i) {
        if (!filterIsConfigured[i]) {
            if (_setFilterSpecific(i, id, mask, extended) >= 0)
                return i;
        }
    }
    
    #ifdef SPDLOG_DEBUG
    logger->debug(SPDLOG_FMT_STRING("Filter {:x} was not set"), (int)id);
    #endif

    return -1;
}

uint32_t CH32CAN::init(uint32_t ul_baudrate)
{
    #ifdef SPDLOG_DEBUG
    logger = spdlog::get("CAN");
    if(logger == nullptr)
        logger = spdlog::default_logger();
    #endif

    GPIO_InitTypeDef      GPIO_InitStructure = {0};

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // Enable 5V pull-up (required for 5V CAN Transceivers that have no internal pull-up)
    // EXTEN->EXTEN_CTR = (EXTEN->EXTEN_CTR & (~EXTEN_USBD_LS) | EXTEN_USBD_PU_EN);

    NVIC_EnableIRQ(USB_HP_CAN1_TX_IRQn);
    NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
    NVIC_EnableIRQ(CAN1_RX1_IRQn);
    NVIC_EnableIRQ(CAN1_SCE_IRQn);
    
    set_baudrate(ul_baudrate);

    readyForTraffic = true;
    return ul_baudrate;
}

uint32_t CH32CAN::beginAutoSpeed()
{
    CANTimingConfig_t oldMode = currentTimingConfig;

    readyForTraffic = false;
    
    bool oldListenMode = listenOnlyMode;
    setListenOnlyMode(true);

    int idx = 0;
    while (valid_timings[idx].speed != 0)
    {
        disable();
        currentTimingConfig = valid_timings[idx].cfg;

        #ifdef SPDLOG_DEBUG
        logger->info(SPDLOG_FMT_STRING("Autospeed, trying {}"), (int) valid_timings[idx].speed);
        #endif

        enable();
        delay(600); //wait a while
        if (cyclesSinceTraffic < 2) //only would happen if there had been traffic
        {
            setListenOnlyMode(oldListenMode);
            #ifdef SPDLOG_DEBUG
            logger->info("Autospeed success");
            #endif
            return valid_timings[idx].speed;
        }
        else
        {
            currentTimingConfig = oldMode;
            #ifdef SPDLOG_DEBUG
            logger->info("Autospeed failed");
            #endif
        }
        idx++;
    }

    #ifdef SPDLOG_DEBUG
    logger->info("Could not complete autospeed");
    #endif

    disable();
    return 0;
}

uint32_t CH32CAN::set_baudrate(uint32_t ul_baudrate)
{
    disable();

    //now try to find a valid timing to use
    int idx = 0;
    while (valid_timings[idx].speed != 0)
    {
        if (valid_timings[idx].speed == ul_baudrate)
        {
            currentTimingConfig = valid_timings[idx].cfg;

            enable();

            return ul_baudrate;
        }
        idx++;
    }

    #ifdef SPDLOG_DEBUG
    logger->error("Invalid bit timing specified");
    #endif
    return 0;
}

void CH32CAN::setListenOnlyMode(bool state)
{
    disable();
    listenOnlyMode = state;
    enable();
}

void CH32CAN::setNoACKMode(bool state)
{
}

void CH32CAN::enable()
{
    CAN_InitTypeDef CAN_InitStructure = {
        .CAN_Prescaler = currentTimingConfig.brp,
        .CAN_Mode = CAN_Mode_Normal,
        .CAN_SJW = currentTimingConfig.sjw,
        .CAN_BS1 = currentTimingConfig.tseg_1,
        .CAN_BS2 = currentTimingConfig.tseg_2,
        .CAN_TTCM = DISABLE,    // Don't use TTCAN
        .CAN_ABOM = DISABLE,    // Manually reset bus after error
        .CAN_AWUM = DISABLE,    // Manually wake-up from sleep
        // .CAN_NART = ENABLE,     // Don't resend messages automatically
        .CAN_NART = DISABLE,     // Resend messages automatically
        .CAN_RFLM = ENABLE,     // When the receiving FIFO overflows, don't receive new messages
        .CAN_TXFP = ENABLE,    // Send priority is determined by the message identifier
    };

    rx_queue = xQueueCreate(rxBufferSize, sizeof(CAN_FRAME));
    tx_queue = xQueueCreate(txBufferSize, sizeof(CAN_FRAME));
    
#if configSUPPORT_STATIC_ALLOCATION
    CAN_Tx_handler_task = xTaskCreateStatic(CAN_Tx_handler, "CAN_TX", sizeof(CAN_Tx_task_stack) / sizeof(StackType_t),
        this, configMAX_PRIORITIES - 1, CAN_Tx_task_stack, &CAN_Tx_task);

#if !defined(CAN_RX_ON_MAIN_LOOP)
    CAN_Rx_handler_task = xTaskCreateStatic(CAN_Rx_handler, "CAN_RX", sizeof(CAN_Tx_task_stack) / sizeof(StackType_t),
        this, configMAX_PRIORITIES - 1, CAN_Rx_task_stack, &CAN_Rx_task);
#endif
#else
    xTaskCreate(CAN_Tx_handler, "CAN_TX", 128, this, configMAX_PRIORITIES - 1, &CAN_Tx_handler_task);
#if !defined(CAN_RX_ON_MAIN_LOOP)
    xTaskCreate(CAN_Rx_handler, "CAN_RX", 256, this, configMAX_PRIORITIES - 1, &CAN_Rx_handler_task);
#endif
#endif
    
    if (CAN_Init(CAN1, &CAN_InitStructure) != CAN_InitStatus_Success) {
        #ifdef SPDLOG_DEBUG
        logger->info("Failed to setup CAN");
        #endif
        return;
    }
    CAN_SlaveStartBank(28);         // all 28 banks belong to CAN1
    CAN1->FCTLR |= 0x1;             // enter filter init mode
    {
        uint32_t filters = 0;
        for (int i = 0; i < BI_NUM_FILTERS; ++i) {
            if (filterIsConfigured[i]) {
                filters |= ((uint32_t)1) << i;
            }
        }
        CAN1->FWR = filters;
    }
    CAN1->FCTLR &= ~(uint32_t)0x1;  // exit filter init mode

    CAN_DBGFreeze(CAN1, DISABLE);
    CAN_WakeUp(CAN1);

    CAN_ITConfig(CAN1, CAN_IT_BOF | CAN_IT_SLK | CAN_IT_EPV | CAN_IT_ERR | CAN_IT_FMP0 | CAN_IT_FMP1 | CAN_IT_FF0 | CAN_IT_FF1 | CAN_IT_TME, ENABLE);
    if (debuggingMode)
    {
        CAN_ITConfig(CAN1, CAN_IT_LEC | CAN_IT_ERR | CAN_IT_FOV0 | CAN_IT_FOV1, ENABLE);
    }
    
