morpheby/esp32_can/src/ch32v203_can_builtin.cpp
    readyForTraffic = true;
}

void CH32CAN::disable()
{
    readyForTraffic = false;

    CAN_DeInit(CAN1);

    if (CAN_Tx_handler_task != NULL)
    {
        vTaskDelete(CAN_Tx_handler_task);
        CAN_Tx_handler_task = NULL;
    }
#if !defined(CAN_RX_ON_MAIN_LOOP)
    if (CAN_Rx_handler_task != NULL)
    {
        vTaskDelete(CAN_Rx_handler_task);
        CAN_Rx_handler_task = NULL;
    }
#endif

    if (rx_queue) {
        vQueueDelete(rx_queue);
        rx_queue = NULL;
    }
    if (tx_queue) {
        vQueueDelete(tx_queue);
        tx_queue = NULL;
    }
}

bool CH32CAN::processFrame(CAN_FRAME &frame, uint8_t filter_id)
{
    CANListener *thisListener;

    cyclesSinceTraffic = 0; //reset counter to show that we are receiving traffic

    if (!readyForTraffic) {
        return false;
    }

    //frame is accepted, lets see if it matches a mailbox callback
    if (cbCANFrame[filter_id])
    {
        (*cbCANFrame[filter_id])(&frame);
    }
    
    for (int listenerPos = 0; listenerPos < SIZE_LISTENERS; listenerPos++)
    {
        thisListener = listener[listenerPos];
        if (thisListener != NULL)
        {
            if (thisListener->isCallbackActive(filter_id)) 
            {
                thisListener->gotFrame(&frame, filter_id);
                return true;
            }
            else if (thisListener->isCallbackActive(numFilters)) //global catch-all 
            {
                thisListener->gotFrame(&frame, 0xFF);
                return true;
            }
        }
    }
    
    if (cbGeneral)
    {
        (*cbGeneral)(&frame);
    }

    #ifdef SPDLOG_DEBUG
    SPDLOG_LOGGER_TRACE(logger, SPDLOG_FMT_STRING("Frame processed at filter {:x}"), (int) filter_id);
    #endif

    return true;
}

bool CH32CAN::sendFrame(CAN_FRAME const &txFrame)
{
    if (!readyForTraffic) return false;
    return xQueueSend(tx_queue, &txFrame, pdMS_TO_TICKS(4)) == pdTRUE;
}

bool CH32CAN::rx_avail()
{
    if (!rx_queue) return false;
    return uxQueueMessagesWaiting(rx_queue) > 0?true:false;
}

uint16_t CH32CAN::available()
{
    if (!rx_queue) return 0;
    return uxQueueMessagesWaiting(rx_queue);
}

uint32_t CH32CAN::get_rx_buff(CAN_FRAME &msg)
{
    CAN_FRAME frame;
    //receive next CAN frame from queue
    if(xQueueReceive(rx_queue,&frame, portMAX_DELAY) == pdTRUE)
    {
        msg = frame; //do a copy in the case that the receive worked
        return true;
    }
    return false; //otherwise we leave the msg variable alone and just return false
}

